Checking out license 'RTL_Compiler_Ultra'... (1 second elapsed)
License 'RTL_Compiler_Ultra' checkout failed.
Checking out license 'RTL_Compiler_Physical'... (1 second elapsed)
License 'RTL_Compiler_Physical' checkout failed.
Checking out license 'RTL_Compiler_Verification'... (0 seconds elapsed)
License 'RTL_Compiler_Verification' checkout failed.
Checking out license 'RTL_Compiler_L'... (1 second elapsed)
License 'RTL_Compiler_L' checkout failed.
Checking out license 'Virtuoso_Digital_Implem'... (1 second elapsed)
Finished loading tool scripts (7 seconds elapsed)

                       Cadence Encounter(R) RTL Compiler
          Version RC14.13 - v14.10-s027_1 (64-bit), built Nov 17 2014


Copyright notice: Copyright 1997-2014 Cadence Design Systems, Inc. All rights 
reserved worldwide. 

WARNING: This version of RC is 1778 days old.
         Visit downloads.cadence.com for the latest release of RC.


================================================================================
                  Welcome to Cadence Encounter(R) RTL Compiler

Here is a quick introduction on how to access our product information.  
If you do not want this message to appear in the future, create an 
initialization file (an empty file will do) in your home directory 
called '~/.cadence/.synth_init'.

  To access the product documentation in HTML and PDF, type 'cdnshelp'
    at the system prompt. 
  For a list of available commands, type 'help'. 
  To view a man page for a command, type 'man <commandName>'.
  To view a man page for an error message, type 'man <messageID>'.
  For a list of all possible object types, type 'get_attribute -help'.
  For a list of all available attributes by object type, type
    'get_attribute * <object_type> -help'.
  For a list of all attributes for every object type, type
    'get_attribute * * -help'
  To list only writable attributes, substitute 'get_attribute' with
    'set_attribute'.
  To get a template script to run RTL Compiler, use the 'write_template'
    command.
  To get a template script to run Conformal based on the current RTL
    Compiler session, use the 'write_do_lec' command.
  
  Obsolete attributes in the current tool version.
  To learn more, type 'get_attribute -help <attribute> <object>'.

            object  attribute
            ------  ---------
       cpf_command  synthesize_complex_expressions
    cpf_command_id  current_set_instance_macro
    cpf_command_id  current_set_instance_module
    cpf_command_id  done_in_apply_cpf
    cpf_command_id  done_in_write_cpf
    cpf_command_id  macro_definition_command
    cpf_command_id  rc_command
            design  dp_perform_rewriting_operations
            design  lp_clock_gating_hierarchical
            design  lp_map_to_srpg_cells
            design  lp_optimize_dynamic_power_first
            design  lp_srpg_pg_driver
          instance  black_box
          instance  dft_inherited_dont_scan
          instance  gint_has_connected_pg_pin
          instance  lp_map_to_srpg_cells
          instance  lp_map_to_srpg_type
          instance  lp_srpg_pg_driver
           libcell  black_box
           libcell  location
               net  logic0_driven
               net  logic1_driven
              root  auto_ungroup_min_effort
              root  degenerate_complex_seqs
              root  disable_power_mode
              root  dp_perform_csa_operations
              root  dp_perform_rewriting_operations
              root  dp_perform_sharing_operations
              root  dp_perform_speculation_operations
              root  driver_for_unloaded_ports
              root  enable_parallel_iopt
              root  enc_in_place_opt
              root  enc_opt_drv
              root  hdl_bit_blast_threshold
              root  hdl_flatten_array
              root  hdl_old_reg_naming
              root  hdl_reg_naming_style_scalar
              root  hdl_reg_naming_style_vector
              root  hdl_trim_target_index
              root  ignore_unknown_embedded_commands
              root  lbr_async_clr_pre_seqs_interchangable
              root  lp_clock_gating_hierarchical
              root  lp_insert_clock_gating_incremental
              root  lp_iopt_mvt_multipass_flow
              root  lp_multi_vt_optimization_effort
              root  ovf_mode
              root  ovf_verification_directory
              root  ple_parameter_source_priority
              root  power_optimization_effort
              root  pqos_virtual_buffer
              root  retime_preserve_state_points
              root  wlec_env_var
              root  wlec_flat_r2n
              root  wlec_no_exit
              root  wlec_old_lp_ec_flow
              root  wlec_save_ssion
              root  wlec_sim_lib
              root  wlec_sim_plus_lib
              root  wlec_skip_iso_check_hier_compare
              root  wlec_skip_lvl_check_hier_compare
              root  wlec_verbose
         subdesign  allow_csa_subdesign
         subdesign  allow_sharing_subdesign
         subdesign  allow_speculation_subdesign
         subdesign  auto_ungroup_ok
         subdesign  dp_perform_rewriting_operations
         subdesign  lp_clock_gating_hierarchical

Send us feedback at rc_feedback@cadence.com.
================================================================================

rc:/> 
rc:/> #Start###################################################################
rc:/> #'puts' command just prints what is in its argument.
rc:/> puts "================="
=================
rc:/> puts "Synthesis Started"
Synthesis Started
rc:/> date
Mon Sep 30 18:16:39 -0700 2019
rc:/> puts "================="
=================
rc:/> #Include TCL utility scripts.
rc:/> include load_etc.tcl
Sourcing '/CMC/tools/cadence/RC14.13.000_lnx86/tools/lib/etc/load_etc.tcl' (Mon Sep 30 18:16:39 -0700 2019)...
Sourcing '/CMC/tools/cadence/RC14.13.000_lnx86/tools/lib/etc/toolbox/insert_io_buffers.tcl' (Mon Sep 30 18:16:39 -0700 2019)...
Sourcing '/CMC/tools/cadence/RC14.13.000_lnx86/tools/lib/etc/toolbox/performance_statistics.tcl' (Mon Sep 30 18:16:39 -0700 2019)...
rc:/> #Set up variables.
rc:/> #set DESIGN <Your_module_name>
rc:/> ##A CHANGE HERE IS REQUIRED##
rc:/> set DESIGN laundrycombo
laundrycombo
rc:/> #set SYN_EFF <Required_synthesis_effort>
rc:/> set SYN_EFF medium
medium
rc:/> #set MAP_EFF <Required_mapping_effort>
rc:/> set MAP_EFF medium
medium
rc:/> #set SYN_PATH <Required_working_directory>
rc:/> set SYN_PATH "."
.
rc:/> #set the PDK's path as a variable 'PDKDIR'
rc:/> set PDKDIR $::env(PDKDIR)
/CMC/kits/AMSKIT616_GPDK/tech
rc:/> ######################################################################
rc:/> #set the search path for the ".lib' files provided with the PDK.
rc:/> set_attribute lib_search_path $PDKDIR/gsclib045_all_v4.4/gsclib045/timing
  Setting attribute of root '/': 'lib_search_path' = /CMC/kits/AMSKIT616_GPDK/tech/gsclib045_all_v4.4/gsclib045/timing
rc:/> #select the needed .lib files.
rc:/> set_attribute library {slow_vdd1v0_basicCells.lib} 
Info    : Created nominal operating condition. [LBR-412]
        : Operating condition '_nominal_' was created for the PVT values (1.000000, 0.900000, 125.000000) in library 'slow_vdd1v0_basicCells.lib'.
        : The nominal operating condition represents either the nominal PVT values if specified in the library source, or the default PVT values (1.0, 1.0, 1.0).

  Message Summary for Library slow_vdd1v0_basicCells.lib:
  *******************************************************
  An unsupported construct was detected in this library. [LBR-40]: 2
  Found 'statetable' group in cell. [LBR-83]: 16
  Created nominal operating condition. [LBR-412]: 1
  *******************************************************
 
  Setting attribute of root '/': 'library' = slow_vdd1v0_basicCells.lib
rc:/> ######################################################################
rc:/> #This command is to read in your RTL code.
rc:/> ##A CHANGE HERE IS REQUIRED##
rc:/> #read_hdl ./in/UP_COUNTER.v
rc:/> ##System Verilog
rc:/> read_hdl -sv /ubc/ece/home/ugrads/a/a0l0b/Cadence_10980150/synth/in/laundrycombo.sv
rc:/> #Elaboration validates the syntax.
rc:/> elaborate $DESIGN
  Library has 324 usable logic and 128 usable sequential lib-cells.
Info    : Found unusable library cells. [LBR-415]
        : Library: 'slow_vdd1v0_basicCells.lib', Total cells: 489, Unusable cells: 19.
	List of unusable cells: 'ANTENNA HOLDX1 TLATNSRX1 TLATNSRX2 TLATNSRX4 TLATNSRXL TLATSRX1 TLATSRX2 TLATSRX4 TLATSRXL ... and others.'
        : For more information, refer to 'Cells Identified as Unusable' in the RC User Guide. The number of unusable cells that is listed depends on the setting of the 'information_level' root attribute. If set to a value less than 6, the list is limited to 10 unusable cells. If set to a value equal to or higher than 6, all unusable cells are listed.
Info    : Elaborating Design. [ELAB-1]
        : Elaborating top-level block 'laundrycombo' from file '/ubc/ece/home/ugrads/a/a0l0b/Cadence_10980150/synth/in/laundrycombo.sv'.
Warning : Using default parameter value for module elaboration. [CDFG-818]
        : Elaborating block 'laundrycombo' with default parameters value.
Info    : Done Elaborating Design. [ELAB-3]
        : Done elaborating 'laundrycombo'.
/designs/laundrycombo
rc:/> #Reports the time and memory used in the elaboration.
rc:/> puts "Runtime & Memory after 'read_hdl'"
Runtime & Memory after 'read_hdl'
rc:/> timestat Elaboration
===========================================
The RUNTIME after Elaboration is 8 secs
and the MEMORY_USAGE after Elaboration is 97.00 MB
===========================================
rc:/> #return problems with your RTL code.
rc:/> check_design -unresolved
  Checking the design.

 	 Check Design Report
	 -------------------- 

  Unresolved References & Empty Modules
  ------------------------------------- 
No unresolved references in design 'laundrycombo'

No empty modules in design 'laundrycombo'

  Done Checking the design.
rc:/> #Read in your clock difinition and timing constraints
rc:/> ##A CHANGE HERE IS REQUIRED##
rc:/> read_sdc /ubc/ece/home/ugrads/a/a0l0b/Cadence_10980150/synth/in/laundrycombo.sdc
Statistics for commands executed by read_sdc:
 "create_clock"            - successful      1 , failed      0 (runtime  0.00)
 "current_design"          - successful      1 , failed      0 (runtime  0.00)
 "get_ports"               - successful      1 , failed      0 (runtime  0.00)
Total runtime 0
rc:/> ######################################################################
rc:/> #Synthesizing to generic cell (not related to the used PDK)
rc:/> synthesize -to_generic -eff $SYN_EFF
Info    : Deleting instances not driving any primary outputs. [GLO-34]
        : Deleting 1 hierarchical instance.
        : Optimizations such as constant propagation or redundancy removal could change the connections so an instance does not drive any primary outputs anymore. To see the list of deleted instances, set the 'information_level' attribute to 2 or above.
  Synthesis succeeded.
rc:/> puts "Runtime & Memory after 'synthesize -to_generic'"
Runtime & Memory after 'synthesize -to_generic'
rc:/> timestat GENERIC
===========================================
The RUNTIME after GENERIC is 8 secs
and the MEMORY_USAGE after GENERIC is 97.00 MB
===========================================
rc:/> #Synthesizing to gates from the used PDK
rc:/> synthesize -to_mapped -eff $MAP_EFF -no_incr
Mapping laundrycombo to gates.
Multi-threaded constant propagation [1|1] ...
Multi-threaded Virtual Mapping (1 thread, 1 of 12 CPUs usable)
 
Global mapping target info
==========================
Cost Group 'clk' target slack:   596 ps
Target path end-point (Pin: state_reg[7]/d)

Multi-threaded Virtual Mapping (1 thread, 1 of 12 CPUs usable)
 
Global mapping status
=====================
                                   Group   
                                  Tot Wrst 
                           Total  Weighted 
Operation                   Area   Slacks  
-------------------------------------------------------------------------------
 global_map                  203        0 
 
Global incremental target info
==============================
Cost Group 'clk' target slack:   396 ps
Target path end-point (Pin: state_reg[6]/D (DFFQX2/D))

 
Global incremental optimization status
======================================
                                   Group   
                                  Tot Wrst 
                           Total  Weighted 
Operation                   Area   Slacks  
-------------------------------------------------------------------------------
 global_incr                 185        0 
Info    : 'Conformal LEC14.1-p100' or later builds is recommended for verification. [WDO-600]
        : The use of 'Conformal LEC14.1-p100' or later builds is recommended to get better verification results.
Generating a dofile for design 'laundrycombo' in file 'fv/laundrycombo/rtl_to_g1.do' ...
Info    : Forcing flat compare. [WDO-212]
        : No hierarchies found in design.

  Done mapping laundrycombo
  Synthesis succeeded.
rc:/> puts "Runtime & Memory after 'synthesize -to_map -no_incr'"
Runtime & Memory after 'synthesize -to_map -no_incr'
rc:/> timestat MAPPED
===========================================
The RUNTIME after MAPPED is 10 secs
and the MEMORY_USAGE after MAPPED is 102.00 MB
===========================================
rc:/> #Incremental Synthesis
rc:/> synthesize -to_mapped -eff $MAP_EFF -incr   
  Incrementally optimizing laundrycombo
 
Incremental optimization status
===============================
                                   Group   
                                  Tot Wrst     Total - - DRC Totals - -
                           Total  Weighted      Neg      Max       Max 
Operation                   Area   Slacks      Slack    Trans      Cap 
-------------------------------------------------------------------------------
 init_iopt                   185        0         0        61        0
 const_prop                  185        0         0        61        0
 
Incremental optimization status
===============================
                                   Group   
                                  Tot Wrst     Total - - DRC Totals - -
                           Total  Weighted      Neg      Max       Max 
Operation                   Area   Slacks      Slack    Trans      Cap 
-------------------------------------------------------------------------------
 init_delay                  185        0         0        61        0

           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
       crit_upsz         0  (        0 /        0 )  0.00
    plc_bal_star         0  (        0 /        0 )  0.00
     drc_buftimb         0  (        0 /        0 )  0.00
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
       plc_ba_st         0  (        0 /        0 )  0.00
     plc_ba_star         0  (        0 /        0 )  0.00
     drc_buftims         0  (        0 /        0 )  0.00
       plc_lo_st         0  (        0 /        0 )  0.00
            fopt         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
            fopt         0  (        0 /        0 )  0.00
        setup_dn         0  (        0 /        0 )  0.00
         buf2inv         0  (        0 /        0 )  0.00
             exp         0  (        0 /        0 )  0.00
       gate_deco         0  (        0 /        0 )  0.00
       gcomp_tim         0  (        0 /        0 )  0.00
  inv_pair_2_buf         0  (        0 /        0 )  0.00

 init_drc                    185        0         0        61        0
 incr_max_trans              188        0         0         0        0

           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
          plc_st         1  (        0 /        0 )  0.00
        plc_star         1  (        0 /        0 )  0.00
        drc_bufs         2  (        1 /        1 )  0.00
        drc_fopt         0  (        0 /        0 )  0.00
        drc_bufb         0  (        0 /        0 )  0.00
      simple_buf         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
       crit_upsz         0  (        0 /        0 )  0.00


           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
      drc_buf_sp         0  (        0 /        0 )  0.00
        drc_bufs         0  (        0 /        0 )  0.00
        drc_fopt         0  (        0 /        0 )  0.00
        drc_bufb         0  (        0 /        0 )  0.00
      simple_buf         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
       crit_upsz         0  (        0 /        0 )  0.00


           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
      drc_buf_sp         0  (        0 /        0 )  0.00
        drc_bufs         0  (        0 /        0 )  0.00
        drc_fopt         0  (        0 /        0 )  0.00
        drc_bufb         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
       crit_upsz         0  (        0 /        0 )  0.00

 init_tns                    188        0         0         0        0

           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
    plc_bal_star         0  (        0 /        0 )  0.00
     drc_buftimb         0  (        0 /        0 )  0.00
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
       plc_ba_st         0  (        0 /        0 )  0.00
     plc_ba_star         0  (        0 /        0 )  0.00
     drc_buftims         0  (        0 /        0 )  0.00
       crit_upsz         0  (        0 /        0 )  0.00
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
       plc_ba_st         0  (        0 /        0 )  0.00
     plc_ba_star         0  (        0 /        0 )  0.00
       plc_lo_st         0  (        0 /        0 )  0.00
            fopt         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
        setup_dn         0  (        0 /        0 )  0.00
         buf2inv         0  (        0 /        0 )  0.00

 init_area                   188        0         0         0        0
 merge_bi                    187        0         0         0        0
 io_phase                    187        0         0         0        0
 glob_area                   186        0         0         0        0

           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
           undup         0  (        0 /        0 )  0.00
         rem_buf         0  (        0 /        0 )  0.00
         rem_inv         2  (        0 /        0 )  0.00
        merge_bi         1  (        1 /        1 )  0.00
      rem_inv_qb         3  (        0 /        0 )  0.01
        io_phase         2  (        2 /        2 )  0.00
       gate_comp         1  (        0 /        0 )  0.01
       gcomp_mog         0  (        0 /        0 )  0.00
       glob_area        14  (        2 /       14 )  0.00
       area_down         1  (        0 /        0 )  0.00
         rem_buf         0  (        0 /        0 )  0.00
         rem_inv         1  (        0 /        0 )  0.00
        merge_bi         0  (        0 /        0 )  0.00
      rem_inv_qb         2  (        0 /        0 )  0.00

 
Incremental optimization status
===============================
                                   Group   
                                  Tot Wrst     Total - - DRC Totals - -
                           Total  Weighted      Neg      Max       Max 
Operation                   Area   Slacks      Slack    Trans      Cap 
-------------------------------------------------------------------------------
 init_delay                  186        0         0         0        0

           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
       crit_upsz         0  (        0 /        0 )  0.00
    plc_bal_star         0  (        0 /        0 )  0.00
     drc_buftimb         0  (        0 /        0 )  0.00
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
       plc_ba_st         0  (        0 /        0 )  0.00
     plc_ba_star         0  (        0 /        0 )  0.00
     drc_buftims         0  (        0 /        0 )  0.00
       plc_lo_st         0  (        0 /        0 )  0.00
            fopt         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
            fopt         0  (        0 /        0 )  0.00
        setup_dn         0  (        0 /        0 )  0.00
         buf2inv         0  (        0 /        0 )  0.00
             exp         0  (        0 /        0 )  0.00
       gate_deco         0  (        0 /        0 )  0.00
       gcomp_tim         0  (        0 /        0 )  0.00
  inv_pair_2_buf         0  (        0 /        0 )  0.00

 init_drc                    186        0         0         0        0

           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
        drc_bufs         0  (        0 /        0 )  0.00
        drc_fopt         0  (        0 /        0 )  0.00
        drc_bufb         0  (        0 /        0 )  0.00
      simple_buf         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
       crit_upsz         0  (        0 /        0 )  0.00


           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
        drc_bufs         0  (        0 /        0 )  0.00
        drc_fopt         0  (        0 /        0 )  0.00
        drc_bufb         0  (        0 /        0 )  0.00
      simple_buf         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
       crit_upsz         0  (        0 /        0 )  0.00


           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
          plc_st         0  (        0 /        0 )  0.00
        plc_star         0  (        0 /        0 )  0.00
        drc_bufs         0  (        0 /        0 )  0.00
        drc_fopt         0  (        0 /        0 )  0.00
        drc_bufb         0  (        0 /        0 )  0.00
             dup         0  (        0 /        0 )  0.00
       crit_dnsz         0  (        0 /        0 )  0.00
       crit_upsz         0  (        0 /        0 )  0.00

 init_area                   186        0         0         0        0

           Trick     Calls     Accepts   Attempts    Time(secs) 
-----------------------------------------------------------
           undup         0  (        0 /        0 )  0.00
         rem_buf         0  (        0 /        0 )  0.00
         rem_inv         1  (        0 /        0 )  0.00
        merge_bi         0  (        0 /        0 )  0.00
      rem_inv_qb         2  (        0 /        0 )  0.00
        io_phase         0  (        0 /        0 )  0.00
       gate_comp         1  (        0 /        0 )  0.01
       gcomp_mog         0  (        0 /        0 )  0.00
       glob_area        14  (        0 /       14 )  0.00
       area_down         1  (        0 /        0 )  0.00


  Done mapping laundrycombo
  Synthesis succeeded.
rc:/> #Insert Tie Hi and Tie low cells 
rc:/> insert_tiehilo_cells
0
rc:/> puts "Runtime & Memory after incremental synthesis"
Runtime & Memory after incremental synthesis
rc:/> timestat INCREMENTAL
===========================================
The RUNTIME after INCREMENTAL is 10 secs
and the MEMORY_USAGE after INCREMENTAL is 107.00 MB
===========================================
rc:/> ######################################################################
rc:/> #write output files and generate reports
rc:/> report area > ./files_out/${DESIGN}_area.rpt
rc:/> report gates > ./files_out/${DESIGN}_gates.rpt
rc:/> report timing > ./files_out/${DESIGN}_timing.rpt
Warning : Possible timing problems have been detected in this design. [TIM-11]
        : The design is 'laundrycombo'.
        : Use 'report timing -lint' for more information.
rc:/> report power > ./files_out/${DESIGN}_power.rpt
rc:/> #generate the verilog file with actual gates-> to be used in Encounter and ModelSim
rc:/> write_hdl -mapped > ./files_out/${DESIGN}_map.v
rc:/> #generate the constaraints file--> to be used in Encounter 
rc:/> write_sdc > ./files_out/${DESIGN}_map.sdc
Finished SDC export (command execution time mm:ss (real) = 00:00).
rc:/> #generate the delays file--> to be used in ModelSimrc  
rc:/> write_sdf > ./files_out/${DESIGN}_map.sdf
Warning : Default value for an option has changed in this release. [WSDF-104]
        : Default value for -setuphold has changed from split to merge_always. Specify '-setuphold split' to preserve the behavior of the previous release.
        : Specify the option explicitly.
Warning : Default value for an option has changed in this release. [WSDF-104]
        : Default value for -recrem has changed from split to merge_always. Specify '-recrem split' to preserve the behavior of the previous release.
rc:/> puts "Final Runtime & Memory."
Final Runtime & Memory.
rc:/> timestat FINAL
===========================================
The RUNTIME after FINAL is 10 secs
and the MEMORY_USAGE after FINAL is 111.00 MB
===========================================
rc:/> #THE END :)
rc:/> puts "====================="
=====================
rc:/> puts "Synthesis Finished :)"
Synthesis Finished :)
rc:/> puts "====================="
=====================
rc:/> #Exit RTL Compiler
rc:/> 